ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151cxx_cm4.h
/********************  Bits definition for DCMI_ESCR register  ******************/
#define DCMI_ESCR_FSC_Pos          (0U)
#define DCMI_ESCR_FSC_Msk          (0xFFUL << DCMI_ESCR_FSC_Pos)               /*!< 0x000000FF */
#define DCMI_ESCR_FSC              DCMI_ESCR_FSC_Msk
#define DCMI_ESCR_LSC_Pos          (8U)
#define DCMI_ESCR_LSC_Msk          (0xFFUL << DCMI_ESCR_LSC_Pos)               /*!< 0x0000FF00 */
#define DCMI_ESCR_LSC              DCMI_ESCR_LSC_Msk
#define DCMI_ESCR_LEC_Pos          (16U)
#define DCMI_ESCR_LEC_Msk          (0xFFUL << DCMI_ESCR_LEC_Pos)               /*!< 0x00FF0000 */
#define DCMI_ESCR_LEC              DCMI_ESCR_LEC_Msk
#define DCMI_ESCR_FEC_Pos          (24U)
#define DCMI_ESCR_FEC_Msk          (0xFFUL << DCMI_ESCR_FEC_Pos)               /*!< 0xFF000000 */
#define DCMI_ESCR_FEC              DCMI_ESCR_FEC_Msk

/********************  Bits definition for DCMI_ESUR register  ******************/
#define DCMI_ESUR_FSU_Pos          (0U)
#define DCMI_ESUR_FSU_Msk          (0xFFUL << DCMI_ESUR_FSU_Pos)               /*!< 0x000000FF */
#define DCMI_ESUR_FSU              DCMI_ESUR_FSU_Msk
#define DCMI_ESUR_LSU_Pos          (8U)
#define DCMI_ESUR_LSU_Msk          (0xFFUL << DCMI_ESUR_LSU_Pos)               /*!< 0x0000FF00 */
#define DCMI_ESUR_LSU              DCMI_ESUR_LSU_Msk
#define DCMI_ESUR_LEU_Pos          (16U)
#define DCMI_ESUR_LEU_Msk          (0xFFUL << DCMI_ESUR_LEU_Pos)               /*!< 0x00FF0000 */
#define DCMI_ESUR_LEU              DCMI_ESUR_LEU_Msk
#define DCMI_ESUR_FEU_Pos          (24U)
#define DCMI_ESUR_FEU_Msk          (0xFFUL << DCMI_ESUR_FEU_Pos)               /*!< 0xFF000000 */
#define DCMI_ESUR_FEU              DCMI_ESUR_FEU_Msk

/********************  Bits definition for DCMI_CWSTRT register  ******************/
#define DCMI_CWSTRT_HOFFCNT_Pos    (0U)
#define DCMI_CWSTRT_HOFFCNT_Msk    (0x3FFFUL << DCMI_CWSTRT_HOFFCNT_Pos)       /*!< 0x00003FFF */
#define DCMI_CWSTRT_HOFFCNT        DCMI_CWSTRT_HOFFCNT_Msk
#define DCMI_CWSTRT_VST_Pos        (16U)
#define DCMI_CWSTRT_VST_Msk        (0x1FFFUL << DCMI_CWSTRT_VST_Pos)           /*!< 0x1FFF0000 */
#define DCMI_CWSTRT_VST            DCMI_CWSTRT_VST_Msk

/********************  Bits definition for DCMI_CWSIZE register  ******************/
#define DCMI_CWSIZE_CAPCNT_Pos     (0U)
#define DCMI_CWSIZE_CAPCNT_Msk     (0x3FFFUL << DCMI_CWSIZE_CAPCNT_Pos)        /*!< 0x00003FFF */
#define DCMI_CWSIZE_CAPCNT         DCMI_CWSIZE_CAPCNT_Msk
#define DCMI_CWSIZE_VLINE_Pos      (16U)
#define DCMI_CWSIZE_VLINE_Msk      (0x3FFFUL << DCMI_CWSIZE_VLINE_Pos)         /*!< 0x3FFF0000 */
#define DCMI_CWSIZE_VLINE          DCMI_CWSIZE_VLINE_Msk

/********************  Bits definition for DCMI_DR register  ******************/
#define DCMI_DR_BYTE0_Pos          (0U)
#define DCMI_DR_BYTE0_Msk          (0xFFUL << DCMI_DR_BYTE0_Pos)               /*!< 0x000000FF */
#define DCMI_DR_BYTE0              DCMI_DR_BYTE0_Msk
#define DCMI_DR_BYTE1_Pos          (8U)
#define DCMI_DR_BYTE1_Msk          (0xFFUL << DCMI_DR_BYTE1_Pos)               /*!< 0x0000FF00 */
#define DCMI_DR_BYTE1              DCMI_DR_BYTE1_Msk
#define DCMI_DR_BYTE2_Pos          (16U)
#define DCMI_DR_BYTE2_Msk          (0xFFUL << DCMI_DR_BYTE2_Pos)               /*!< 0x00FF0000 */
#define DCMI_DR_BYTE2              DCMI_DR_BYTE2_Msk
#define DCMI_DR_BYTE3_Pos          (24U)
#define DCMI_DR_BYTE3_Msk          (0xFFUL << DCMI_DR_BYTE3_Pos)               /*!< 0xFF000000 */
#define DCMI_DR_BYTE3              DCMI_DR_BYTE3_Msk

/******************************************************************************/
/*                                                                            */
/*                    DDRCTRL block description (DDRCTRL)                     */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for DDRCTRL_MSTR register  *****************/
#define DDRCTRL_MSTR_DDR3_Pos              (0U)
#define DDRCTRL_MSTR_DDR3_Msk              (0x1U << DDRCTRL_MSTR_DDR3_Pos)              /*!< 0x00000001 */
#define DDRCTRL_MSTR_DDR3                  DDRCTRL_MSTR_DDR3_Msk                        /*!< Selects DDR3 SDRAM */
#define DDRCTRL_MSTR_LPDDR2_Pos            (2U)
#define DDRCTRL_MSTR_LPDDR2_Msk            (0x1U << DDRCTRL_MSTR_LPDDR2_Pos)            /*!< 0x00000004 */
#define DDRCTRL_MSTR_LPDDR2                DDRCTRL_MSTR_LPDDR2_Msk                      /*!< Selects LPDDR2 SDRAM */
#define DDRCTRL_MSTR_LPDDR3_Pos            (3U)
#define DDRCTRL_MSTR_LPDDR3_Msk            (0x1U << DDRCTRL_MSTR_LPDDR3_Pos)            /*!< 0x00000008 */
#define DDRCTRL_MSTR_LPDDR3                DDRCTRL_MSTR_LPDDR3_Msk                      /*!< Selects LPDDR3 SDRAM */
#define DDRCTRL_MSTR_BURSTCHOP_Pos         (9U)
#define DDRCTRL_MSTR_BURSTCHOP_Msk         (0x1U << DDRCTRL_MSTR_BURSTCHOP_Pos)         /*!< 0x00000200 */
#define DDRCTRL_MSTR_BURSTCHOP             DDRCTRL_MSTR_BURSTCHOP_Msk                   /*!< When set, enable burst-chop (BC4 or 8 on-the-fly) in DDR3/DDR4. the burst-chop for Reads is exercised only in HIF configurations (UMCTL2_INCL_ARB not set) and if in full bus width mode (MSTR.data_bus_width = 00) and if MEMC_BURST_LENGTH=8 or 16. The burst-chop for writes is exercised only if partial writes enabled (UMCTL2_PARTIAL_WR=1) and if CRC is disabled (CRCPARCTL1.crc_enable = 0). */
#define DDRCTRL_MSTR_EN_2T_TIMING_MODE_Pos (10U)
#define DDRCTRL_MSTR_EN_2T_TIMING_MODE_Msk (0x1U << DDRCTRL_MSTR_EN_2T_TIMING_MODE_Pos) /*!< 0x00000400 */
#define DDRCTRL_MSTR_EN_2T_TIMING_MODE     DDRCTRL_MSTR_EN_2T_TIMING_MODE_Msk           /*!< If 1, then the DDRCTRL uses 2T timing. Otherwise, uses 1T timing. In 2T timing, all command signals (except chip select) are held for 2 clocks on the SDRAM bus. The chip select is asserted on the second cycle of the command */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos    (12U)
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_Msk    (0x3U << DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00003000 */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH        DDRCTRL_MSTR_DATA_BUS_WIDTH_Msk              /*!< Selects proportion of DQ bus width that is used by the SDRAM */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_0      (0x1U << DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00001000 */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_1      (0x2U << DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00002000 */
#define DDRCTRL_MSTR_DLL_OFF_MODE_Pos      (15U)
#define DDRCTRL_MSTR_DLL_OFF_MODE_Msk      (0x1U << DDRCTRL_MSTR_DLL_OFF_MODE_Pos)      /*!< 0x00008000 */
#define DDRCTRL_MSTR_DLL_OFF_MODE          DDRCTRL_MSTR_DLL_OFF_MODE_Msk                /*!< Set to 1 when the DDRCTRL and DRAM has to be put in DLL-off mode for low frequency operation. */
#define DDRCTRL_MSTR_BURST_RDWR_Pos        (16U)
#define DDRCTRL_MSTR_BURST_RDWR_Msk        (0xFU << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x000F0000 */
#define DDRCTRL_MSTR_BURST_RDWR            DDRCTRL_MSTR_BURST_RDWR_Msk                  /*!< SDRAM burst length used: */
#define DDRCTRL_MSTR_BURST_RDWR_0          (0x1U << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00010000 */
#define DDRCTRL_MSTR_BURST_RDWR_1          (0x2U << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00020000 */
#define DDRCTRL_MSTR_BURST_RDWR_2          (0x4U << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00040000 */
#define DDRCTRL_MSTR_BURST_RDWR_3          (0x8U << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00080000 */

/*****************  Bit definition for DDRCTRL_STAT register  *****************/
#define DDRCTRL_STAT_OPERATING_MODE_Pos        (0U)
#define DDRCTRL_STAT_OPERATING_MODE_Msk        (0x7U << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000007 */
#define DDRCTRL_STAT_OPERATING_MODE            DDRCTRL_STAT_OPERATING_MODE_Msk                  /*!< Operating mode. This is 3-bits wide in configurations with mDDR/LPDDR2/LPDDR3/LPDDR4/DDR4 support and 2-bits in all other configurations. */
#define DDRCTRL_STAT_OPERATING_MODE_0          (0x1U << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000001 */
#define DDRCTRL_STAT_OPERATING_MODE_1          (0x2U << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000002 */
#define DDRCTRL_STAT_OPERATING_MODE_2          (0x4U << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000004 */
#define DDRCTRL_STAT_SELFREF_TYPE_Pos          (4U)
#define DDRCTRL_STAT_SELFREF_TYPE_Msk          (0x3U << DDRCTRL_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000030 */
#define DDRCTRL_STAT_SELFREF_TYPE              DDRCTRL_STAT_SELFREF_TYPE_Msk                    /*!< Flags if Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4) is entered and if it was under Automatic Self Refresh control only or not. */
#define DDRCTRL_STAT_SELFREF_TYPE_0            (0x1U << DDRCTRL_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000010 */
#define DDRCTRL_STAT_SELFREF_TYPE_1            (0x2U << DDRCTRL_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000020 */
#define DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Pos (12U)
#define DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Msk (0x1U << DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Pos) /*!< 0x00001000 */
#define DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY     DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Msk           /*!< Self refresh with CAMs not empty. Set to 1 when Self Refresh is entered but CAMs are not drained. Cleared after exiting Self Refresh. */

/***************  Bit definition for DDRCTRL_MRCTRL0 register  ****************/
#define DDRCTRL_MRCTRL0_MR_TYPE_Pos (0U)
#define DDRCTRL_MRCTRL0_MR_TYPE_Msk (0x1U << DDRCTRL_MRCTRL0_MR_TYPE_Pos) /*!< 0x00000001 */
#define DDRCTRL_MRCTRL0_MR_TYPE     DDRCTRL_MRCTRL0_MR_TYPE_Msk           /*!< Indicates whether the mode register operation is read or write. Only used for LPDDR2/LPDDR3/LPDDR4/DDR4. */
#define DDRCTRL_MRCTRL0_MR_RANK_Pos (4U)
#define DDRCTRL_MRCTRL0_MR_RANK_Msk (0x1U << DDRCTRL_MRCTRL0_MR_RANK_Pos) /*!< 0x00000010 */
#define DDRCTRL_MRCTRL0_MR_RANK     DDRCTRL_MRCTRL0_MR_RANK_Msk           /*!< Controls which rank is accessed by MRCTRL0.mr_wr. Normally, it is desired to access all ranks, so all bits should be set to 1. However, for multi-rank UDIMMs/RDIMMs/LRDIMMs which implement address mirroring, it may be necessary to access ranks individually. */
#define DDRCTRL_MRCTRL0_MR_ADDR_Pos (12U)
#define DDRCTRL_MRCTRL0_MR_ADDR_Msk (0xFU << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x0000F000 */
#define DDRCTRL_MRCTRL0_MR_ADDR     DDRCTRL_MRCTRL0_MR_ADDR_Msk           /*!< Address of the mode register that is to be written to. */
#define DDRCTRL_MRCTRL0_MR_ADDR_0   (0x1U << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00001000 */
#define DDRCTRL_MRCTRL0_MR_ADDR_1   (0x2U << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00002000 */
#define DDRCTRL_MRCTRL0_MR_ADDR_2   (0x4U << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00004000 */
#define DDRCTRL_MRCTRL0_MR_ADDR_3   (0x8U << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00008000 */
#define DDRCTRL_MRCTRL0_MR_WR_Pos   (31U)
#define DDRCTRL_MRCTRL0_MR_WR_Msk   (0x1U << DDRCTRL_MRCTRL0_MR_WR_Pos)   /*!< 0x80000000 */
#define DDRCTRL_MRCTRL0_MR_WR       DDRCTRL_MRCTRL0_MR_WR_Msk             /*!< Setting this register bit to 1 triggers a mode register read or write operation. When the MR operation is complete, the DDRCTRL automatically clears this bit. The other register fields of this register must be written in a separate APB transaction, before setting this mr_wr bit. It is recommended NOT to set this signal if in Init, Deep power-down or MPSM operating modes. */

/***************  Bit definition for DDRCTRL_MRCTRL1 register  ****************/
#define DDRCTRL_MRCTRL1_MR_DATA_Pos (0U)
#define DDRCTRL_MRCTRL1_MR_DATA_Msk (0xFFFFU << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x0000FFFF */
#define DDRCTRL_MRCTRL1_MR_DATA     DDRCTRL_MRCTRL1_MR_DATA_Msk              /*!< Mode register write data for all non-LPDDR2/non-LPDDR3/non-LPDDR4 modes. */
#define DDRCTRL_MRCTRL1_MR_DATA_0   (0x1U << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000001 */
#define DDRCTRL_MRCTRL1_MR_DATA_1   (0x2U << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000002 */
#define DDRCTRL_MRCTRL1_MR_DATA_2   (0x4U << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000004 */
#define DDRCTRL_MRCTRL1_MR_DATA_3   (0x8U << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000008 */
#define DDRCTRL_MRCTRL1_MR_DATA_4   (0x10U << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000010 */
#define DDRCTRL_MRCTRL1_MR_DATA_5   (0x20U << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000020 */
#define DDRCTRL_MRCTRL1_MR_DATA_6   (0x40U << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000040 */
#define DDRCTRL_MRCTRL1_MR_DATA_7   (0x80U << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000080 */
#define DDRCTRL_MRCTRL1_MR_DATA_8   (0x100U << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000100 */
#define DDRCTRL_MRCTRL1_MR_DATA_9   (0x200U << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000200 */
#define DDRCTRL_MRCTRL1_MR_DATA_10  (0x400U << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000400 */
#define DDRCTRL_MRCTRL1_MR_DATA_11  (0x800U << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000800 */
#define DDRCTRL_MRCTRL1_MR_DATA_12  (0x1000U << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00001000 */
#define DDRCTRL_MRCTRL1_MR_DATA_13  (0x2000U << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00002000 */
#define DDRCTRL_MRCTRL1_MR_DATA_14  (0x4000U << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00004000 */
#define DDRCTRL_MRCTRL1_MR_DATA_15  (0x8000U << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00008000 */

